OpenFOAMcases/ATB/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0004;

boundaryField
{
    back
    {
        type            wedge;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0004;
        value           uniform 0.0004;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0004;
        value           uniform 0.0004;
    }
    top
    {
        type            inletOutlet;
        inletValue      uniform 0.0004;
        value           uniform 0.0004;
    }
}


// ************************************************************************* //
